import math
    '''Подключение библиотеки math для использования числа пи'''

def area(r):
    '''Принимает число r - радиус круга, возвращает площадь курга
    
    Параметры:
        r: радиус круга
        
    Возвращаемое значение:
        area: площадь круга
    
    Пример вызова:
    area(3)
    28.26
    '''
    return math.pi * r * r


def perimeter(r):
    '''Принимает число r - радиус круга, возвращает длину окружности
    
    Параметры:
        r: радиус круга
        
    Возвращаемое значение:
        perimeter: длина окружности
    
    Пример вызова:
    perimetr(3)
    18.84
    '''
    return 2 * math.pi * r

