def area(a, b):
    '''принимает числа а, b - длины сторон прямоугольника, возвращает площадь прямоугольника

    Параметры:
        a: длина одной стороны прямоугольника
        b: длина другой стороны прямоугольника

    Возвращаемое значение:
        area: площадь прямоугольника

    Пример вызова:
    area(3, 4)
    12
    '''
    return a * b

def perimeter(a, b):
    '''принимает числа а, b - длины сторон прямоугольника, возвращает периметр прямоугольника

    Параметры:
        a: длина одной стороны прямоугольника
        b: длина другой стороны прямоугольника

    Возвращаемое значение:
        area: периметр прямоугольника

    Пример вызова:
    area(3, 4)
    14
    '''
    return (a + b) * 2



