
def area(a):
    '''принимает число а - длина стороны квадрата, возвращает площадь квадрата

    Параметры:
        a: длина стороны квадрата
        
    Возвращаемое значение:
        area: площадь квадрата

    Пример вызова:
    area(3)
    9
    '''
    return a * a


def perimeter(a):
    '''принимает число а - длина стороны квадрата, возвращает периметр квадрата

    Параметры:
        a: длина стороны квадрата
        
    Возвращаемое значение:
        perimeter: периметр квадрата

    Пример вызова:
    perimeter(3)
    12
    '''
    return 4 * a
