def area(a, h):
    '''принимает числа а, h - основание и высота треуголька, возвращает площадь треугольника

    Параметры:
        a: основание треугольника
        h: высота треуггольника

    Возвращаемое значение:
        area: площадь треугольника

    Пример вызова:
    area(3, 4)
    6
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''принимает числа а, b, c - длины сторон треугольника, возвращает периметр треугольника

    Параметры:
        a: длина первой стороны треугольника
        b: длина второй стороны треугольника
        c: длина третьей стороны треугольника

    Возвращаемое значение:
        area: периметр треугольника

    Пример вызова:
    area(3, 4, 5)
    12
    '''
    return a + b + c





